import { ChangesList } from "./ChangesList";
import { IDevLog } from "./types";

const devLogList: IDevLog[] = [
  {
    date: "20.03.2023",
    title: "Добавлена система акцій в тестування",
    description:
      "В цьому оновленні було добавлено таблицю для створення акцій.",
  },
  {
    date: "20.03.2023",
    title: "Оновлено вид таблиць",
    description:
      "В цьому оновленні було оновлено та покращено функціонал в таблицях.",
  },
  {
    date: "18.03.2023",
    title: "Додавання пошуку Товарів та Категорій",
    description:
      "В цьому оновленні було добавлено можливість пошуку для Товарів та Категорій.",
  },
  {
    date: "17.03.2023",
    title: "Додавання, редагування та видалення Товарів",
    description:
      "В цьому оновленні було добавлено можливість додавати, редагувати та видаляти товари на сайті.",
  },
  {
    date: "15.03.2023",
    title: "Список Товарів",
    description: "В цьому оновленні було добавлено список для товарів.",
  },
  {
    date: "14.03.2023",
    title: "Виправлення багів зв'язані з додавання та редагуванням Категорій",
    description:
      "В цьому оновленні було виправлено недоліки звя'зані з додаванням та редагуванням категорій.",
  },
  {
    date: "14.03.2023",
    title: "Додавання, редагування та видалення Категорій",
    description:
      "В цьому оновленні було добавлено можливість додавати, редагувати та видаляти категорії на сайті.",
  },
  {
    date: "13.03.2023",
    title: "Створення адмін панелі",
    description:
      "В цьому оновленні було добавлено віддільну сторінку для адміністраторів.",
  },
];

const AdminHomePage = () => {
  return (
    <>
      <div className="flex flex-col">
        <div className="-my-2 overflow-x-auto sm:-mx-6 lg:-mx-8">
          <div className="py-2 align-middle inline-block min-w-full sm:px-6 lg:px-8">
            <h2 className="text-2xl font-bold text-gray-900">
              Список оновлень панелі адміністратора
            </h2>

            <ChangesList array={devLogList} />
          </div>
        </div>
      </div>
    </>
  );
};

export default AdminHomePage;
